nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mk1024mcf064.h
PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterOversamplingModeRatioSelect(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO ratio)
{
     ADCHS_DigitalFilterOversamplingModeRatioSelect_pic32mk(index, id, ratio);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterAveragingModeSampleCountSelect(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT count)
{
     ADCHS_DigitalFilterAveragingModeSampleCountSelect_pic32mk(index, id, count);
}

PLIB_INLINE_API bool PLIB_ADCHS_DigitalFilterDataIsReady(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id)
{
     return ADCHS_DigitalFilterDataIsReady_pic32mk(index, id);
}

PLIB_INLINE_API int16_t PLIB_ADCHS_DigitalFilterDataGet(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID dfltrID)
{
     return ADCHS_DigitalFilterDataGet_pic32mk(index, dfltrID);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterDataReadyInterruptEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID digFilter)
{
     ADCHS_DigitalFilterDataReadyInterruptEnable_pic32mk(index, digFilter);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterDataReadyInterruptDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID digFilter)
{
     ADCHS_DigitalFilterDataReadyInterruptDisable_pic32mk(index, digFilter);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsDigitalFilter(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsDigitalFilter_pic32mk(index);
}

PLIB_INLINE_API int32_t _PLIB_UNSUPPORTED PLIB_ADCHS_FIFORead(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFORead_Unsupported(index);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_FIFODataIsAvailable(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFODataIsAvailable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_FIFODataReadyInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_FIFODataReadyInterruptEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_FIFODataReadyInterruptDisable(ADCHS_MODULE_ID index)
{
     ADCHS_FIFODataReadyInterruptDisable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_FIFOEnable(ADCHS_MODULE_ID index)
{
     ADCHS_FIFOEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_FIFODisable(ADCHS_MODULE_ID index)
{
     ADCHS_FIFODisable_Unsupported(index);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_FIFOSourceSelect(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_FIFOSourceSelect_Unsupported(index, channelID);
}

PLIB_INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_ADCHS_FIFODataCountGet(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFODataCountGet_Unsupported(index);
}

PLIB_INLINE_API ADCHS_CHANNEL_ID _PLIB_UNSUPPORTED PLIB_ADCHS_FIFOSourceGet(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFOSourceGet_Unsupported(index);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_FIFOErrorHasOccurred(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFOErrorHasOccurred_Unsupported(index);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_FIFODataIsNegative(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFODataIsNegative_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsFIFO(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsFIFO_Unsupported(index);
}

PLIB_INLINE_API void PLIB_ADCHS_DMAEnable(ADCHS_MODULE_ID index)
{
     ADCHS_DMAEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_DMADisable(ADCHS_MODULE_ID index)
{
     ADCHS_DMADisable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_DMASetup(ADCHS_MODULE_ID index, ADCHS_DMA_BUFFER_LENGTH bufferLengthBytes, uint32_t baseAddress, ADCHS_DMA_COUNT countMode, uint32_t countBaseAddress)
{
     ADCHS_DMASetup_Default(index, bufferLengthBytes, baseAddress, countMode, countBaseAddress);
}

PLIB_INLINE_API bool PLIB_ADCHS_DMASourceEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMASourceEnable_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_DMASourceDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMASourceDisable_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_DMABuffer_A_InterruptEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_A_InterruptEnable_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_DMABuffer_A_InterruptDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_A_InterruptDisable_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_DMABuffer_B_InterruptEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_B_InterruptEnable_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_DMABuffer_B_InterruptDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_B_InterruptDisable_Default(index, channelID);
}

PLIB_INLINE_API int8_t PLIB_ADCHS_DMABuffer_A_IsFull(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_A_IsFull_Default(index, channelID);
}

PLIB_INLINE_API int8_t PLIB_ADCHS_DMABuffer_B_IsFull(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_B_IsFull_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_DMAOverflowErrorHasOccurred(ADCHS_MODULE_ID index)
{
     return ADCHS_DMAOverflowErrorHasOccurred_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsDMA(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsDMA_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_CVDEnable(ADCHS_MODULE_ID index)
{
     ADCHS_CVDEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_CVDDisable(ADCHS_MODULE_ID index)
{
     ADCHS_CVDDisable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_CVDSetup(ADCHS_MODULE_ID index, ADCHS_CVD_CAPACITOR capSel, bool inBetweenOrEqual, bool greaterEqualHi, bool lessThanHi, bool greaterEqualLo, bool lessThanLo, ADCHS_AN_INPUT_ID inputEnable, int16_t hiLimit, int16_t loLimit)
{
     ADCHS_CVDSetup_Default(index, capSel, inBetweenOrEqual, greaterEqualHi, lessThanHi, greaterEqualLo, lessThanLo, inputEnable, hiLimit, loLimit);
}

PLIB_INLINE_API int16_t PLIB_ADCHS_CVDResultGet(ADCHS_MODULE_ID index)
{
     return ADCHS_CVDResultGet_Default(index);
}

